#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_secretsmanager_secret.secret: Reading...
aws_route53_zone.thomaskimble_zone: Refreshing state... [id=Z06242472H0DG7GFLG30T]
aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/29037fba-829c-4870-9979-4b1574a8c6fd]
data.aws_secretsmanager_secret.secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
data.aws_secretsmanager_secret_version.current: Reading...
aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d393xlsrttjy5b]
aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_amplify_branch.main: Refreshing state... [id=d393xlsrttjy5b/main]
aws_amplify_branch.dev: Refreshing state... [id=d393xlsrttjy5b/dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_amplify_domain_association.thomaskimble will be created
  + resource "aws_amplify_domain_association" "thomaskimble" {
      + app_id                              = "d393xlsrttjy5b"
      + arn                                 = (known after apply)
      + certificate_verification_dns_record = (known after apply)
      + domain_name                         = "thomaskimble.com"
      + enable_auto_sub_domain              = false
      + id                                  = (known after apply)
      + wait_for_verification               = false

      + sub_domain {
          + branch_name = "dev"
          + dns_record  = (known after apply)
          + prefix      = "dev"
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*